iProdWHSE/Documents/Responses/sample_ordini_elaborati.txt

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
	<soapenv:Body>
	<ns2:readAllJobsResV01 xmlns:ns2="http://main.jws.com.hanel.de">
	<ns2:return>
		<job xmlns="http://main.jws.com.hanel.de/xsd">
			<jobNumber>COMM2</jobNumber>
			<jobPriority>100</jobPriority>
			<jobStatus>3</jobStatus>
			<jobDate>110220</jobDate>
			<jobTime>1601</jobTime>
			<JobPosition>
				<articleNumber>ARTICOLO1</articleNumber>
				<operation>+</operation>
				<nominalQuantity>10</nominalQuantity>
				<actualQuantity>10</actualQuantity>
				<containerSize>101</containerSize>
				<positionStatus>1</positionStatus>
			</JobPosition>
	       </job>
               <ns1:returnValue xmlns:ns1="http://main.jws.com.hanel.de/xsd">1</ns1:returnValue>
        </ns2:return>
        </ns2:readAllJobsResV01>
    </soapenv:Body>
</soapenv:Envelope>